## 데이터 프레임 복습

In [1]:
# 데이터 프레임 생성 
import pandas as pd

In [2]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
type(df)

pandas.core.frame.DataFrame

In [3]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [14]:
a = [[1, 4, 7], [2, 5, 8], [3, 6, 9]]
a

[[1, 4, 7], [2, 5, 8], [3, 6, 9]]

In [15]:
df2 = pd.DataFrame(a)
df2

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [9]:
df2.columns = ['a', 'b', 'c']
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [10]:
df3 = pd.DataFrame({'company' : ['abc', '회사', '123'], '직원수' : [400, 10, 6]})
df3

  company  직원수
0     abc  400
1      회사   10
2     123    6

In [11]:
import numpy as np
df3['위치'] = ['Seoul', np.nan, 'Busan']
df3

  company  직원수     위치
0     abc  400  Seoul
1      회사   10    NaN
2     123    6  Busan

In [17]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [18]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [19]:
df.columns[1]

'b'

In [20]:
df.columns = ['d', 'e', 'f']
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

In [21]:
df.columns = ['디', 'e', '에프']
df

   디  e  에프
0  1  4   7
1  2  5   8
2  3  6   9

In [22]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [24]:
df.rename(columns ={'a' : '디', 'c' : '에프'}, inplace = True)
df

   디  b  에프
0  1  4   7
1  2  5   8
2  3  6   9

In [27]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})

In [28]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [29]:
df.rename(columns = {'a' : '에이'}, inplace = True)

In [30]:
df

   에이  b  c
0   1  4  7
1   2  5  8
2   3  6  9

In [31]:
import copy

In [32]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})
df2 = copy.deepcopy(df)
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [33]:
df2.columns = ['d', 'e', 'f']

In [34]:
df, df2

(   a  b  c
 0  1  4  7
 1  2  5  8
 2  3  6  9,
    d  e  f
 0  1  4  7
 1  2  5  8
 2  3  6  9)

In [35]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})

In [36]:
df['a']

0    1
1    2
2    3
Name: a, dtype: int64

In [37]:
type(df['a'])

pandas.core.series.Series

In [38]:
a = pd.Series([1, 2, 3, 1, 2, 3])
a

0    1
1    2
2    3
3    1
4    2
5    3
dtype: int64

In [39]:
a = pd.Series([1, 2, 3, 1, 2, 3], index = ['a', 'b', 'c', 'd', 'e', 'f'])
a

a    1
b    2
c    3
d    1
e    2
f    3
dtype: int64

In [40]:
a['e']

2

In [41]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [42]:
a = df['a']
a

0    1
1    2
2    3
Name: a, dtype: int64

In [43]:
a.unique()

array([1, 2, 3], dtype=int64)

In [45]:
df[['a', 'b']]

   a  b
0  1  4
1  2  5
2  3  6

In [47]:
# loc, iloc   
df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11, 21)], 'c' : [i for i in range(21, 31)]})
df

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

In [48]:
df[['a', 'b']]

    a   b
0   1  11
1   2  12
2   3  13
3   4  14
4   5  15
5   6  16
6   7  17
7   8  18
8   9  19
9  10  20

In [51]:
df.loc[0]

a     1
b    11
c    21
Name: 0, dtype: int64

In [52]:
df.loc[2 : 4]

   a   b   c
2  3  13  23
3  4  14  24
4  5  15  25

In [72]:
index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'g', 'h', 'i']
df.index = index
df

    a   b   c
a   1  11  21
b   2  12  22
c   3  13  23
d   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [59]:
df.loc['g']

   a   b   c
g  7  17  27
g  8  18  28

In [60]:
df.loc['c' : ]

    a   b   c
c   3  13  23
d   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [73]:
df.loc[['g', 'i'], ['a', 'c']]

    a   c
g   7  27
g   8  28
i  10  30

In [74]:
df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11, 21)], 'c' : [i for i in range(21, 31)]})
df.iloc[ : 5, [0, 2]]

   a   c
0  1  21
1  2  22
2  3  23
3  4  24
4  5  25

In [75]:
index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'g', 'h', 'i']
df.index = index
df

    a   b   c
a   1  11  21
b   2  12  22
c   3  13  23
d   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [76]:
df.iloc[ : 5, [0, 2]]

   a   c
a  1  21
b  2  22
c  3  23
d  4  24
e  5  25

In [77]:
df = pd.DataFrame({'a' : [i for i in range(1, 11)], 'b' : [i for i in range(11, 21)], 'c' : [i for i in range(21, 31)]})
df

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

In [78]:
df.loc[ : , ['a', 'c']]

    a   c
0   1  21
1   2  22
2   3  23
3   4  24
4   5  25
5   6  26
6   7  27
7   8  28
8   9  29
9  10  30

In [79]:
df.loc[df['a'] >= 3]

    a   b   c
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30